üìò 01 ‚Äî Creating Series and DataFrames

üü¶ 1. Importing Pandas

In [1]:
import pandas as pd

üü¶ 2. Creating a Series

2.1 From a Python list

In [ ]:
numbers = [10, 20, 30, 40, 50]
s = pd.Series(numbers)
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

2.2 Setting custom index labels

In [4]:
s2 = pd.Series(numbers, index=["a", "b", "c", "d", "e"])
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

2.3 From a dictionary

In [6]:
data = {"Math": 90, "Science": 85, "History": 88}
s3 = pd.Series(data)
s3

Math       90
Science    85
History    88
dtype: int64

üü¶ 3. Creating a DataFrame

3.1 From a dictionary of lists

In [7]:
student_data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [24, 19, 22],
    "Grade": ["A", "B", "A"]
}

df1 = pd.DataFrame(student_data)
df1

      Name  Age Grade
0    Alice   24     A
1      Bob   19     B
2  Charlie   22     A

3.2 From a list of dictionaries

In [8]:
records = [
    {"Name": "Alice", "Age": 24, "Grade": "A"},
    {"Name": "Bob", "Age": 19, "Grade": "B"},
    {"Name": "Charlie", "Age": 22, "Grade": "A"}
]

df2 = pd.DataFrame(records)
df2

      Name  Age Grade
0    Alice   24     A
1      Bob   19     B
2  Charlie   22     A

3.3 From a list of lists + custom column names

In [9]:
rows = [
    [1, "Apple", 3.5],
    [2, "Banana", 2.0],
    [3, "Orange", 4.2]
]

df3 = pd.DataFrame(rows, columns=["ID", "Fruit", "Price"])
df3

   ID   Fruit  Price
0   1   Apple    3.5
1   2  Banana    2.0
2   3  Orange    4.2

üü¶ 4. Creating DataFrame with Custom Index

In [10]:
df4 = pd.DataFrame(
    student_data,
    index=["student_1", "student_2", "student_3"]
)
df4

              Name  Age Grade
student_1    Alice   24     A
student_2      Bob   19     B
student_3  Charlie   22     A

üü¶ 5. Creating DataFrame from NumPy Array

In [11]:
import numpy as np

arr = np.array([[10, 20], [30, 40], [50, 60]])
df5 = pd.DataFrame(arr, columns=["Col1", "Col2"])
df5

   Col1  Col2
0    10    20
1    30    40
2    50    60

üü¶ 6. Adding Columns After Creation

In [12]:
df1["Passed"] = df1["Grade"].apply(lambda g: g in ["A", "B"])
df1

      Name  Age Grade  Passed
0    Alice   24     A    True
1      Bob   19     B    True
2  Charlie   22     A    True

üü¶ 7. Setting and Resetting Index

Set index

In [13]:
df6 = df1.set_index("Name")
df6

         Age Grade  Passed
Name
Alice     24     A    True
Bob       19     B    True
Charlie   22     A    True

Reset index

In [14]:
df6.reset_index()

      Name  Age Grade  Passed
0    Alice   24     A    True
1      Bob   19     B    True
2  Charlie   22     A    True

üü¶8. Recommended Additional Examples

8.1 Creating an Empty DataFrame

In [15]:
empty_df = pd.DataFrame()
empty_df

Empty DataFrame
Columns: []
Index: []

8.2 Creating a DataFrame with a Single Column

In [16]:
df_single = pd.DataFrame({"Numbers": [1, 2, 3, 4]})
df_single

   Numbers
0        1
1        2
2        3
3        4

8.3 Creating a Series with a Name

In [17]:
s = pd.Series([10, 20, 30], name="Scores")
s

0    10
1    20
2    30
Name: Scores, dtype: int64

8.4 Creating DataFrame from a Pandas Series Dictionary

In [18]:
s1 = pd.Series([1, 2, 3], name="A")
s2 = pd.Series([4, 5, 6], name="B")

df = pd.DataFrame({"A": s1, "B": s2})
df

   A  B
0  1  4
1  2  5
2  3  6

8.5 Creating DataFrame with dtype specified

In [19]:
df_typed = pd.DataFrame(
    {"A": [1, 2, 3], "B": [4.5, 5.5, 6.5]},
    dtype="float"
)
df_typed

     A    B
0  1.0  4.5
1  2.0  5.5
2  3.0  6.5

8.6 Creating DataFrame with MultiIndex

In [20]:
arrays = [
    ["A", "A", "B", "B"],
    [1, 2, 1, 2]
]

multi_index = pd.MultiIndex.from_arrays(arrays, names=["Group", "ID"])

df_multi = pd.DataFrame({"Value": [10, 20, 30, 40]}, index=multi_index)
df_multi

          Value
Group ID
A     1      10
      2      20
B     1      30
      2      40

8.7 Creating DataFrame from a CSV string

In [22]:
from io import StringIO

csv_data = """
name,age,city
Alice,24,Toronto
Bob,19,Montreal
"""

df_from_string = pd.read_csv(StringIO(csv_data))
df_from_string

    name  age      city
0  Alice   24   Toronto
1    Bob   19  Montreal

8.8 Create a DataFrame using range()

In [23]:
df_range = pd.DataFrame({
    "Number": range(1, 6),
    "Square": [x*x for x in range(1, 6)]
})
df_range

   Number  Square
0       1       1
1       2       4
2       3       9
3       4      16
4       5      25

## üü¶ 9. Summary

In this section, you learned how to create pandas objects from scratch, including:

### üß© **Series**
- ‚úîÔ∏è Create **Series** from lists  
- ‚úîÔ∏è Create **Series** from dictionaries  
- ‚úîÔ∏è Assign **custom index labels**  
- ‚úîÔ∏è Add a **name** to a Series  
- ‚úîÔ∏è Specify **data types (dtype)**  
- ‚úîÔ∏è Create **empty Series**

### üìä **DataFrames**
- ‚úîÔ∏è Create DataFrames from **dictionary of lists**  
- ‚úîÔ∏è Create DataFrames from **list of dictionaries**  
- ‚úîÔ∏è Create DataFrames from **list of lists**  
- ‚úîÔ∏è Create DataFrames from **multiple Series**  
- ‚úîÔ∏è Create DataFrames from **NumPy arrays**  
- ‚úîÔ∏è Create DataFrames from a **CSV string** (using `StringIO`)  
- ‚úîÔ∏è Create DataFrames using **range()**  
- ‚úîÔ∏è Set a **custom index**  
- ‚úîÔ∏è Create DataFrames with a **specified dtype**  
- ‚úîÔ∏è Build **MultiIndex DataFrames**
- ‚úîÔ∏è Create **empty DataFrames**

### üõ†Ô∏è Basic Construction Operations
- ‚úîÔ∏è Add new columns  
- ‚úîÔ∏è Reset and set index

## Great job! üéâ  


You're now ready to move to the next section: **Selecting & Filtering Data**.